src/Tasks/Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>Взаимодействие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТема</Name>
					<Comment>Содержание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Comment>Подробное описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаАвтор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДатаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительФактический</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействияСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСостоялось</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеИспользовать</Name>
					<Comment>Напоминать о задаче</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереносов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеПредставление</Name>
					<Comment>Представление задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыВзаимодействий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей взаимодействию, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Tasks/Взаимодействие/Forms/ФормаЗадачиБыстрая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник;
	
	Если Параметры.Свойство("ВзаимодействиеЗадачаПараметры") Тогда
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры = Параметры.ВзаимодействиеЗадачаПараметры;
		ЭтотОбъект.ВидВзаимодействия			 = Параметры.ВзаимодействиеЗадачаПараметры.ВидВзаимодействия;
		ЭтотОбъект.ВидВзаимодействияСправочник	 = Параметры.ВзаимодействиеЗадачаПараметры.Взаимодействие;
		ЭтотОбъект.ВзаимодействиеЗадачаТема		 = Параметры.ВзаимодействиеЗадачаПараметры.Взаимодействие.ТемаПоУмолчанию;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Контрагент") Тогда
		ЭтотОбъект.Контрагент = Параметры.ЗначенияЗаполнения.Контрагент;
	КонецЕсли;
	ЗаполнитьСписокВыбораРежимаНапоминанияВзаимодействияЗадача();
	
	Если Параметры.Свойство("ВзаимодействиеСделка") Тогда
		ЭтотОбъект.ВзаимодействиеСделка = Параметры.ВзаимодействиеСделка;
		УстановитьАктуальнуюСделкуВзаимодействия();
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВзаимодействия();
	ВыборВзаимодействиеЗадачаНаСервере();
	
	Элементы.ГруппаВаимодействиеСделкаПредставление.Видимость = ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Выбор сделки взаимодействия.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыборСделкиВзаимодействия(Команда)
	
	СписокВыбора = ВернутьСписокСделокКлиента(Контрагент);
	
	Если ЗначениеЗаполнено(СписокВыбора) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораСделкиВзаимодействия", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.ВзаимодействиеСделка);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Нет доступных сделок!';en='Not available deals!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача статус не выполнена.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаСтатусНеВыполнена(Команда)
	
	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Ложь;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Ложь
	);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача статус выполнена.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаСтатусВыполнена(Команда)
	
	ЭтотОбъект.ВзаимодействиеЗадачаДата      = ПолучитьОкругленноеВремяВзаимодействия(Истина);
	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Истина;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Истина
	);
	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие задача режим напоминания.
//
Процедура ВзаимодействиеЗадачаРежимНапоминания(Команда)

	Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора, Элементы.ВзаимодействиеЗадачаНапоминание);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие создать.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаСоздать(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаДата) Тогда
		ВзаимодействиеЗадачаСоздатьСервер();
		Закрыть(НоваяЗадачаСсылка);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнены данные взаимодействия!';en='Not populated with data interactions!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие исполнитель.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаИсполнитель(Команда)
	
	Оповещение     = Новый ОписаниеОповещения("ОбработчикВыбораИсполнителяЗадачи", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Ключ", ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);	
	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаВыбораИсполнителя", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие выбрать.
//
Процедура ВидВзаимодействияСправочникВыбор(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВидаВзаимодействияСправочникЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора, Элементы.ВидВзаимодействияСправочникВыбор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
// Процедура - Взаимодействие задача звонок дата при изменении.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ВзаимодействиеЗадачаДатаПриИзменении(Элемент)
	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача дата обработка выбора.
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВзаимодействиеЗадачаДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача дата окончание ввода текста.
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура ВзаимодействиеЗадачаДатаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		Попытка
			СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(Дата(Текст + " 00:00:00"));	
		Исключение
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача время обработка выбора.
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВзаимодействиеЗадачаВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Задача выполнена при изменении.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗадачаВыполненаПриИзменении(Элемент)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Ложь Тогда
		УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Ложь
		);
		
	Иначе
		ЭтотОбъект.ВзаимодействиеЗадачаДата      = ПолучитьОкругленноеВремяВзаимодействия(Истина);
		ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Истина;
		
		УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Истина
		);
		
		ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Установить актуальную сделку взаимодействия.
//
Процедура УстановитьАктуальнуюСделкуВзаимодействия()
	
	// Установить актуальную сделку клиента.
	ЭтотОбъект.ВзаимодействиеСделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Контрагент);
	
	УстановитьСостояниеЭлементовСделкиВзаимодействия(
		ЭтотОбъект.ВзаимодействиеСделка, 
		?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеСделка), ЭтотОбъект.ВзаимодействиеСделка.ЭтапСделки.ЦветЭтапа, Неопределено)
	);

КонецПроцедуры

&НаКлиенте
// Процедура - Обработка сделки взаимодействия клиента завершение.
//
Процедура ОбработчикВыбораСделкиВзаимодействия(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		УстановитьСостояниеЭлементовСделкиВзаимодействия(Результат.Значение.Сделка, Результат.Значение.ЦветЭтапа);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обработчик выбора сделки взаимодействия сервер.
//
// Параметры:
//  Сделка		 - 	 - 
//  ЦветЭтапа	 - 	 - 
//
Процедура УстановитьСостояниеЭлементовСделкиВзаимодействия(Сделка, ЦветЭтапа)
	
	ЦветФона = ?(ЗначениеЗаполнено(ЦветЭтапа), ЗначениеИзСтрокиВнутр(ЦветЭтапа), Новый Цвет());
	ЦветФона = ?(ЦветФона = Новый Цвет(), Новый Цвет(214, 234, 255), ЦветФона);
	
	Представление = ?(ЗначениеЗаполнено(Сделка), Строка(Сделка), НСтр("ru='Выбрать сделку';en='Select a deal'"));
	
	ЭтотОбъект.ВзаимодействиеСделка                          = Сделка; 
	Элементы.ВзаимодействиеСделка.Заголовок                  = Представление;
	ЭтаФорма.Команды["ВзаимодействиеСделка"].Подсказка       = Представление;
	Элементы.ГруппаВаимодействиеСделкаПредставление.ЦветФона = ЦветФона;
	Элементы.ВзаимодействиеСделка.ЦветТекста                 = ОбщегоНазначенияСтоматология.ПолучитьЦветТекстаПоЦветуФона(ЦветФона, Истина);

КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение.
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = Результат.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = Результат.Представление;

		Если Результат.Представление = "в момент события" Тогда
			Элементы.ДекорацияОтступ.Ширина = 15;
		ИначеЕсли Результат.Представление = "не напоминать" Тогда
			Элементы.ДекорацияОтступ.Ширина = 17;
		ИначеЕсли Результат.Представление = "за 15 минут" ИЛИ Результат.Представление = "за 10 минут" ИЛИ Результат.Представление = "за 30 минут" Тогда
			Элементы.ДекорацияОтступ.Ширина = 19;
	    ИначеЕсли Результат.Представление = "за 5 минут" Тогда
			Элементы.ДекорацияОтступ.Ширина = 20;
		ИначеЕсли Результат.Представление = "за 1 час" ИЛИ Результат.Представление = "за 2 дня" Тогда
			Элементы.ДекорацияОтступ.Ширина = 21;
		ИначеЕсли Результат.Представление = "за 1 день" Тогда
			Элементы.ДекорацияОтступ.Ширина = 20;
		ИначеЕсли Результат.Представление = "за 2 часа" Тогда
			Элементы.ДекорацияОтступ.Ширина = 21;
		ИначеЕсли Результат.Представление = "за 1 неделю" Тогда
			Элементы.ДекорацияОтступ.Ширина = 19;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ВзаимодействиеЗадачаСоздатьСервер()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Контрагент"                 , Контрагент);
	ДанныеЗаполнения.Вставить("ВидВзаимодействия"          , ЭтотОбъект.ВзаимодействиеЗадачаПараметры.ВидВзаимодействия);
	ДанныеЗаполнения.Вставить("ВидВзаимодействияСправочник", ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Взаимодействие);
	ДанныеЗаполнения.Вставить("Исполнитель"                , ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);
	ДанныеЗаполнения.Вставить("ЗадачаНазначеннаяДата"      , ЭтотОбъект.ВзаимодействиеЗадачаДата);
	ДанныеЗаполнения.Вставить("ЗадачаТема"                 , ?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаТема), ЭтотОбъект.ВзаимодействиеЗадачаТема, ""));
	ДанныеЗаполнения.Вставить("ЗадачаОписание"             , ЭтотОбъект.ВзаимодействиеЗадачаТекст);
	ДанныеЗаполнения.Вставить("Сделка"                     , ЭтотОбъект.ВзаимодействиеСделка);
	ДанныеЗаполнения.Вставить("Выполнена"                  , ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);
	
	НоваяЗадача = Задачи.Взаимодействие.СоздатьЗадачу();
	НоваяЗадача.Заполнить(ДанныеЗаполнения);	
	
	Задачи.Взаимодействие.ЗаполнитьПараметрыНапоминания(НоваяЗадача, Новый Структура("ЗадачаРежимНапоминания", ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания));	
	
	НоваяЗадача.Записать();
	НоваяЗадачаСсылка = НоваяЗадача.Ссылка;
	
	ВзаимодействиеЗадачаТема  = "";
	ВзаимодействиеЗадачаТекст = "";
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик выбора исполнителя взаимодействия.
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработчикВыбораИсполнителяЗадачи(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		//Если ТипЗнч(Результат) = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка") Тогда
			Представление = ПолучитьПредставлениеФИОСотрудника(Результат);
		//Иначе
		//	Представление = ""; //ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат, "Наименование");		
		//КонецЕсли;
		
		ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = Результат;
		Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить представление ФИОСотрудника.
//
Функция ПолучитьПредставлениеФИОСотрудника(Сотрудник)
	
	Возврат Справочники.Сотрудники.ПредставлениеФИОСотрудника(Сотрудник);		
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Вернуть список сделок контрагента.
// 
Функция ВернутьСписокСделокКлиента(Контрагент)
		
	СписокСделок = Новый СписокЗначений;
	
	ТаблицаСделок = ПолучитьСделкиКлиента(Контрагент, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Для Каждого СтрокаТ Из ТаблицаСделок Цикл
				
		ПараметрыСделки = Новый Структура;
		ПараметрыСделки.Вставить("Сделка"   , СтрокаТ.Ссылка);
		ПараметрыСделки.Вставить("ЦветЭтапа", СтрокаТ.ЦветЭтапа);
		
		СписокСделок.Добавить(ПараметрыСделки, СтрокаТ.Наименование);	
		
	КонецЦикла;	
		
	Возврат СписокСделок; 
	
КонецФункции   

&НаСервереБезКонтекста
// Функция, возвращает сделки по контрагенту.
//
Функция ПолучитьСделкиКлиента(Контрагент, СтруктурнаяЕдиница = Неопределено)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Ссылка,
	|	Сделки.Наименование КАК Наименование,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапСделки.ЦветЭтапа КАК ЦветЭтапа
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	НЕ Сделки.ПометкаУдаления
	|	И Сделки.Контрагент = &Контрагент
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки");
	
	Запрос.УстановитьПараметр("Контрагент", 		Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), "И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);	
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

&НаСервере
// Процедура - Взаимодействие задача звонок дата при изменении на сервере.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ВзаимодействиеЗадачаДатаПриИзмененииНаСервере()
	
	ЗаполнитьСписокВыбораВремениЭлемента("ВзаимодействиеЗадачаВремя", ЭтотОбъект.ВзаимодействиеЗадачаДата);
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить списки выбора времени окончания работы.
//
// Параметры:
//  ВремяНачала	 - 	 -
//  ЭлементФормы - 	 -
//
Процедура ЗаполнитьСписокВыбораВремениЭлемента(ИмяЭлементаФормы, Знач ДатаНачала)
	
	ЭлементФормы = Элементы[ИмяЭлементаФормы];
	
	ПериодРаботы = Новый Структура;
	ПериодРаботы.Вставить("ДатаНачала"   , НачалоДня(ДатаНачала));
	ПериодРаботы.Вставить("ДатаОкончания", НачалоДня(ДатаНачала) + 86400);
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, Ложь, 30);
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Для Каждого Элемент Из СписокВремени Цикл
		
		Представление = ?(Минута(Элемент.Значение) = 0, Элемент.Представление, Новый ФорматированнаяСтрока(Элемент.Представление,, Новый Цвет(100, 100, 100)));
		ЭлементФормы.СписокВыбора.Добавить(Элемент.Значение, Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить округленное время взаимодействия.
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОкругленноеВремяВзаимодействия(ПолучитьТекДату = Ложь)
	
	ДатаВремя = ТекущаяДатаСеанса() + ?(ПолучитьТекДату, 0, 86400);
	
	КоличествоИнтервалов      = (ДатаВремя - НачалоДня(ДатаВремя)) / 1800;
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервалов);
	
	// Округлить в большую сторону.
	Если ПолучитьТекДату = Ложь
		И КоличествоИнтервалов <> КоличествоЦелыхИнтервалов Тогда
		
		Возврат НачалоДня(ДатаВремя) + (КоличествоЦелыхИнтервалов + 1) * 1800;
	Иначе
		Возврат НачалоДня(ДатаВремя) + КоличествоЦелыхИнтервалов * 1800;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция - Взаимодействие задача разрешено создание на указанную дату.
//
// Параметры:
//  ВыбраннаяДата	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбраннаяДата)
	
	Если ВыбраннаяДата > ТекущаяДата() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Создание выполненных задач будущей датой запрещено!';en='creation Completed Tasks of the Future by date prohibited!'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Процедура - Выбор взаимодействия на клиенте.
//
Процедура ВыборВзаимодействиеЗадачаНаСервере()
	
	Элементы.ДекорацияВзаимодействиеЗадачаИконка.Картинка     = ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Картинка;
	Элементы.ДекорацияВзаимодействиеЗадачаИконка.Видимость    = ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Картинка);
	Элементы.ДекорацияВзаимодействиеЗадачаЗаголовок.Заголовок = ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Представление;
	
	ТемаМенялась = Истина;	
	Если ЗначениеЗаполнено(ВзаимодействиеЗадачаТема) Тогда 
		Для Каждого ЭлементСписка Из ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора Цикл 
			Если СокрЛП(ЭлементСписка.Значение.ТемаПоУмолчанию) = СокрЛП(ВзаимодействиеЗадачаТема) Тогда 
				ТемаМенялась = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	ЭтотОбъект.ВзаимодействиеЗадачаТема  = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТема) И ТемаМенялась, ВзаимодействиеЗадачаТема, ЭтотОбъект.ВзаимодействиеЗадачаПараметры.ТемаПоУмолчанию);
	ЭтотОбъект.ВзаимодействиеЗадачаТекст = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТекст), ВзаимодействиеЗадачаТекст, "");
	
	// Установить дату взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
	// Обновить исполнителя взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = ЭтотОбъект.ТекущийПользователь;	
	Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = ПолучитьПредставлениеФИОСотрудника(ЭтотОбъект.ТекущийПользователь);
		
	// Обновить режим напоминания взаимодействия.
	РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
	Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;
	
	АктивныйЭлемент   = ?(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	НеактивныйЭлемент = ?(Не ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора режима напоминания.
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминанияВзаимодействияЗадача()
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Очистить();
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(-1	   , "не напоминать");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(0     , "в момент события");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(300   , "за 5 минут");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(600   , "за 10 минут");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(900   , "за 15 минут");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(1800  , "за 30 минут");     
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(3600  , "за 1 час");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(7200  , "за 2 часа");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(86400 , "за 1 день");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(172800, "за 2 дня");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(604800, "за 1 неделю");
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания = -1;
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораВзаимодействия()
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора.Очистить();
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора = Справочники.ВидыВзаимодействий.ПолучитьСписокВзаимодействий();
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВидВзаимодействияСправочник) Тогда                                     
		Для Каждого Взаимодействие Из ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора Цикл
			Если Взаимодействие.Значение.Взаимодействие = ЭтотОбъект.ВидВзаимодействияСправочник Тогда
				
				Элементы.ДекорацияВзаимодействиеЗадачаИконка.Картинка	 = Взаимодействие.Картинка;
				Элементы.ДекорацияВзаимодействиеЗадачаИконка.Видимость	 = ЗначениеЗаполнено(Взаимодействие.Картинка);
				Элементы.ВидВзаимодействияСправочникВыбор.Заголовок		 = Взаимодействие.Представление;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение.
//
Процедура ВыборВидаВзаимодействияСправочникЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Элементы.ДекорацияВзаимодействиеЗадачаИконка.Картинка		 = Результат.Картинка;
		Элементы.ДекорацияВзаимодействиеЗадачаИконка.Видимость		 = ЗначениеЗаполнено(Результат.Картинка);
		Элементы.ВидВзаимодействияСправочникВыбор.Заголовок			 = Результат.Представление;
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.ВидВзаимодействия	 = Результат.Значение.ВидВзаимодействия;
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Взаимодействие   	 = Результат.Значение.Взаимодействие;
		
		//ЭтотОбъект.ВидВзаимодействияСправочник = Результат.Значение.Взаимодействие;
		//ЭтотОбъект.ВидВзаимодействия           = Результат.Значение.ВидВзаимодействия;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
